cases/design_v0/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| Analytical Design: generated OpenFOAM file                                  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// ************************************************************************* //

transportModel  Newtonian;
nu              [0 2 -1 0 0 0 0] 1e-06;
DT              1;
