cases/design_v0/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| Analytical Design: generated OpenFOAM file                                  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// ************************************************************************* //

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0.001 0 0);
boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.001 0 0);
    }
    outlet_inner { type zeroGradient; }
    outlet_outer { type zeroGradient; }
    inner_electrode { type noSlip; }
    outer_electrode { type noSlip; }
    top_wall { type noSlip; }
    bottom_wall { type noSlip; }
}
