cases/design_v0/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| Analytical Design: generated OpenFOAM file                                  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// ************************************************************************* //

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    inlet { type zeroGradient; }
    outlet_inner { type fixedValue; value uniform 0; }
    outlet_outer { type fixedValue; value uniform 0; }
    inner_electrode { type zeroGradient; }
    outer_electrode { type zeroGradient; }
    top_wall { type zeroGradient; }
    bottom_wall { type zeroGradient; }
}
