cases/design_v0/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| Analytical Design: generated OpenFOAM file                                  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// ************************************************************************* //

ddtSchemes { default Euler; }
gradSchemes
{
    default none;
    grad(T) Gauss linear;
    grad(U) Gauss linear;
}
divSchemes
{
    default none;
    div(phi,U) bounded Gauss linearUpwind grad(U);
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}
laplacianSchemes
{
    default Gauss linear corrected;
    laplacian(DT,T) Gauss linear corrected;
}
interpolationSchemes { default linear; }
snGradSchemes { default corrected; }
wallDist { method meshWave; }
