cases/design_v0/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| Analytical Design: generated OpenFOAM file                                  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// ************************************************************************* //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          0.01;
        smoother        GaussSeidel;
    }
    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
    }
    phiE
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
    }
    T
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
    }
}
SIMPLE
{
    nNonOrthogonalCorrectors 2;
    consistent yes;
}
relaxationFactors
{
    fields { p 0.3; }
    equations { U 0.7; }
}
