cases/design_v0/Allrun
#!/usr/bin/env bash
set -euo pipefail
cd "$(dirname "$0")"
checkMesh | tee log.checkMesh
laplacianFoam | tee log.laplacianFoam
touch design_v0.foam
